# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

work_time, rate, premium  = argv[1:]
salary = float(work_time) * float(rate) + float(premium)
print(f"Salary is: {salary}")
